Merge pull request #518 from minijackson/readthedocs
docs: add readthedocs build
